// Task 1
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//456 -> 5
//782 -> 8
//918 -> 1

//using System;

//class Program
//{
// static void Selectsamplingthesecondnumber();

Console.Write("Hello, please enter a three-digit number ");
string secondnumber = Console.ReadLine();
Console.WriteLine(secondnumber[1]);

//static void Main(string[] args) Совсем запутался со структурой программы- works as is.
//    {
//         Selectsamplingthesecondnumber();
//   }